spec/fixtures/vcr_cassettes/refund_difference_on_lowered_price.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card[name]=Joseph%20Sak&card[number]=4111111111111111&card[exp_month]=1&card[exp_year]=2015&card[cvc]=123&description=accountguy1%40email.com
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_UU7bBFT4BMFznL5a35ZE0CIx
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Josephs-Air-2.att.net 14.0.0 Darwin Kernel Version 14.0.0: Tue Sep 23 23:01:41
        PDT 2014; root:xnu-2782.1.97~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '141'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 15 Oct 2014 05:30:28 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1289'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - f56a8688-2554-48a0-a4c2-46ab7415c931
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1413351028,
          "id": "cus_4xfibCY8H7CNAu",
          "livemode": false,
          "description": "accountguy1@email.com",
          "email": null,
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_4xfibCY8H7CNAu/subscriptions",
            "data": []
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4xfibCY8H7CNAu/cards",
            "data": [
              {
                "id": "card_14nkMi2L7z1ZOsnrrTSJIImL",
                "object": "card",
                "last4": "1111",
                "brand": "Visa",
                "funding": "unknown",
                "exp_month": 1,
                "exp_year": 2015,
                "fingerprint": "NWaGmOeJgKG5VPPE",
                "country": "US",
                "name": "Joseph Sak",
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "customer": "cus_4xfibCY8H7CNAu"
              }
            ]
          },
          "default_card": "card_14nkMi2L7z1ZOsnrrTSJIImL"
        }
    http_version: 
  recorded_at: Wed, 15 Oct 2014 05:30:28 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=200&currency=usd&customer=cus_4xfibCY8H7CNAu&description=Group%20session%3A%20beda6f85-1036-41c9-835b-989a731699ea%20for%20Joe%20Account
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_UU7bBFT4BMFznL5a35ZE0CIx
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Josephs-Air-2.att.net 14.0.0 Darwin Kernel Version 14.0.0: Tue Sep 23 23:01:41
        PDT 2014; root:xnu-2782.1.97~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '143'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 15 Oct 2014 05:31:27 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1350'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - 44b3cb19-c4c4-46df-8be8-22b4212010fb
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_14nkNf2L7z1ZOsnrMXChy0ia",
          "object": "charge",
          "created": 1413351087,
          "livemode": false,
          "paid": true,
          "amount": 200,
          "currency": "usd",
          "refunded": false,
          "card": {
            "id": "card_14nkMi2L7z1ZOsnrrTSJIImL",
            "object": "card",
            "last4": "1111",
            "brand": "Visa",
            "funding": "unknown",
            "exp_month": 1,
            "exp_year": 2015,
            "fingerprint": "NWaGmOeJgKG5VPPE",
            "country": "US",
            "name": "Joseph Sak",
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null,
            "customer": "cus_4xfibCY8H7CNAu"
          },
          "captured": true,
          "refunds": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/charges/ch_14nkNf2L7z1ZOsnrMXChy0ia/refunds",
            "data": []
          },
          "balance_transaction": "txn_14nkNf2L7z1ZOsnr5lQrQZUG",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": "cus_4xfibCY8H7CNAu",
          "invoice": null,
          "description": "Group session: beda6f85-1036-41c9-835b-989a731699ea for Joe Account",
          "dispute": null,
          "metadata": {},
          "statement_description": null,
          "receipt_email": null,
          "receipt_number": null,
          "shipping": null
        }
    http_version: 
  recorded_at: Wed, 15 Oct 2014 05:31:27 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/charges/ch_14nkNf2L7z1ZOsnrMXChy0ia
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_UU7bBFT4BMFznL5a35ZE0CIx
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Josephs-Air-2.att.net 14.0.0 Darwin Kernel Version 14.0.0: Tue Sep 23 23:01:41
        PDT 2014; root:xnu-2782.1.97~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 15 Oct 2014 05:31:28 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1350'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - 4db2e126-4f78-4485-893c-382e3feb10bb
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_14nkNf2L7z1ZOsnrMXChy0ia",
          "object": "charge",
          "created": 1413351087,
          "livemode": false,
          "paid": true,
          "amount": 200,
          "currency": "usd",
          "refunded": false,
          "card": {
            "id": "card_14nkMi2L7z1ZOsnrrTSJIImL",
            "object": "card",
            "last4": "1111",
            "brand": "Visa",
            "funding": "unknown",
            "exp_month": 1,
            "exp_year": 2015,
            "fingerprint": "NWaGmOeJgKG5VPPE",
            "country": "US",
            "name": "Joseph Sak",
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null,
            "customer": "cus_4xfibCY8H7CNAu"
          },
          "captured": true,
          "refunds": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/charges/ch_14nkNf2L7z1ZOsnrMXChy0ia/refunds",
            "data": []
          },
          "balance_transaction": "txn_14nkNf2L7z1ZOsnr5lQrQZUG",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": "cus_4xfibCY8H7CNAu",
          "invoice": null,
          "description": "Group session: beda6f85-1036-41c9-835b-989a731699ea for Joe Account",
          "dispute": null,
          "metadata": {},
          "statement_description": null,
          "receipt_email": null,
          "receipt_number": null,
          "shipping": null
        }
    http_version: 
  recorded_at: Wed, 15 Oct 2014 05:31:27 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges/ch_14nkNf2L7z1ZOsnrMXChy0ia/refunds
    body:
      encoding: US-ASCII
      string: amount=100
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_UU7bBFT4BMFznL5a35ZE0CIx
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Josephs-Air-2.att.net 14.0.0 Darwin Kernel Version 14.0.0: Tue Sep 23 23:01:41
        PDT 2014; root:xnu-2782.1.97~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '10'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 15 Oct 2014 05:31:28 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '271'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - f4c12c02-8729-4819-90b0-a5fe314097f3
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "re_14nkNg2L7z1ZOsnrGTPl3pTz",
          "amount": 100,
          "currency": "usd",
          "created": 1413351088,
          "object": "refund",
          "balance_transaction": "txn_14nkNg2L7z1ZOsnrfWSPtLS2",
          "metadata": {},
          "charge": "ch_14nkNf2L7z1ZOsnrMXChy0ia",
          "receipt_number": null
        }
    http_version: 
  recorded_at: Wed, 15 Oct 2014 05:31:28 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=100&currency=usd&customer=cus_4xfibCY8H7CNAu&description=Group%20session%3A%20beda6f85-1036-41c9-835b-989a731699ea%20for%20Joe%20Account
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_UU7bBFT4BMFznL5a35ZE0CIx
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Josephs-Air-2.att.net 14.0.0 Darwin Kernel Version 14.0.0: Tue Sep 23 23:01:41
        PDT 2014; root:xnu-2782.1.97~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '143'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 15 Oct 2014 05:31:29 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1350'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - f9ce5d4c-9087-4020-b62f-89bb4ced0d82
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_14nkNh2L7z1ZOsnrbB5ZDacN",
          "object": "charge",
          "created": 1413351089,
          "livemode": false,
          "paid": true,
          "amount": 100,
          "currency": "usd",
          "refunded": false,
          "card": {
            "id": "card_14nkMi2L7z1ZOsnrrTSJIImL",
            "object": "card",
            "last4": "1111",
            "brand": "Visa",
            "funding": "unknown",
            "exp_month": 1,
            "exp_year": 2015,
            "fingerprint": "NWaGmOeJgKG5VPPE",
            "country": "US",
            "name": "Joseph Sak",
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null,
            "customer": "cus_4xfibCY8H7CNAu"
          },
          "captured": true,
          "refunds": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/charges/ch_14nkNh2L7z1ZOsnrbB5ZDacN/refunds",
            "data": []
          },
          "balance_transaction": "txn_14nkNh2L7z1ZOsnrEMvQF8Y8",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": "cus_4xfibCY8H7CNAu",
          "invoice": null,
          "description": "Group session: beda6f85-1036-41c9-835b-989a731699ea for Joe Account",
          "dispute": null,
          "metadata": {},
          "statement_description": null,
          "receipt_email": null,
          "receipt_number": null,
          "shipping": null
        }
    http_version: 
  recorded_at: Wed, 15 Oct 2014 05:31:29 GMT
recorded_with: VCR 2.9.3
